{ "questions":
{ "1": [ 5, 5, 4, 4, 3, 4, 5, 5, 4, 4, 4, 5, 5, 5, 4 ],
  "2": [ 2, 1, 1, 1, 1, 1, 5, 1, 3, 1, 1, 1, 2, 1, 2 ],
  "3": [ 5, 5, 5, 5, 5, 3, 4, 5, 4, 5, 3, 5, 5, 4, 3 ],
  "4": [ 5, 5, 5, 5, 4, 5, 4, 5, 4, 5, 4, 5, 5, 4, 4 ],
  "5": [ 5, 5, 5, 4, 4, 4, 5, 5, 4, 5, 4, 4, 5, 4, 4 ],
  "6": [ 5, 5, 5, 4, 4, 4, 4, 4, 3, 3, 2, 4, 4, 4, 4 ],
  "7": [ 5, 5, 3, 4, 4, 5, 4, 4, 4, 4, 4, 5, 4, 4, 4 ],
  "8": [ 5, 4, 2, 3, 4, 3, 3, 4, 3, 5, 1, 4, 4, 4, 3 ],
  "9": [ 5, 4, 4, 3, 4, 3, 5, 4, 4, 5, 3, 5, 5, 4, 5 ],
  "10": [ 5, 5, 5, 4, 4, 5, 5, 4, 4, 3, 4, 5, 5, 4, 4 ],
  "11": [ 5, 5, 4, 4, 4, 4, 5, 4, 4, 3, 4, 4, 4, 4, 4 ],
  "12": [ 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5 ],
  "13": [ 5, 3, 5, 4, 4, 4, 3, 3, 2, 4, 5, 4, 1, 2, 5 ],
  "14": [ 5, 3, 5, 3, 3, 4, 5, 4, 4, 4, 5, 4, 5, 5, 4 ],
  "15": [ 5, 2, 2, 4, 5, 5, 4, 4, 3, 4, 3, 4, 5, 4, 4 ],
  "16": [ 5, 3, 4, 4, 3, 4, 5, 4, 4, 3, 1, 4, 4, 4, 5 ],
  "17": [ 5, 5, 5, 4, 4, 5, 5, 5, 4, 4, 5, 5, 5, 5, 4 ],
  "18": [ 5, 5, 5, 3, 3, 4, 5, 5, 3, 2, 1, 5, 5, 5, 3 ],
  "19": [ 5, 4, 4, 3, 3, 4, 5, 5, 3, 5, 5, 4, 4, 5, 5 ],
  "20": [ 5, 4, 1, 2, 2, 5, 5, 5, 3, 2, 2, 3, 5, 3, 3 ],
  "21": [ 5, 5, 4, 4, 3, 5, 5, 5, 4, 4, 5, 5, 5, 4, 5 ],
  "22": [ 5, 5, 5, 3, 3, 4, 4, 5, 4, 5, 4, 4, 5, 3, 4 ],
  "23": [ 5, 3, 3, 4, 3, 4, 4, 2, 3, 3, 1, 4, 5, 3, 4 ],
  "24": [ 5, 3, 5, 3, 3, 3, 4, 3, 3, 4, 3, 5, 3, 3, 5 ],
  "25": [ 5, 4, 2, 5, 4, 4, 5, 4, 4, 4, 1, 5, 5, 3, 4 ],
  "26": [ 5, 4, 4, 4, 3, 3, 3, 4, 4, 4, 3, 3, 5, 4, 5 ],
  "27": [ 5, 5, 4, 5, 5, 5, 4, 5, 4, 3, 5, 4, 5, 4, 5 ],
  "28": [ 5, 5, 4, 4, 4, 4, 4, 5, 3, 5, 4, 4, 4, 4, 5 ],
  "29": [ 5, 2, 4, 5, 4, 4, 5, 3, 4, 5, 1, 4, 5, 3, 4 ],
  "30": [ 5, 4, 3, 5, 4, 4, 5, 4, 4, 4, 1, 4, 5, 4, 5 ],
  "31": [ 5, 5, 2, 5, 3, 2, 4, 4, 3, 2, 1, 5, 5, 4, 4 ],
  "32": [ 5, 5, 5, 4, 3, 3, 4, 3, 4, 4, 2, 3, 5, 3, 5 ],
  "33": [ 5, 4, 5, 4, 3, 4, 4, 3, 4, 4, 1, 4, 4, 4, 3 ],
  "34": [ 5, 5, 5, 4, 2, 2, 2, 5, 3, 1, 1, 1, 2, 2, 1 ],
  "35": [ 5, 5, 2, 3, 3, 3, 3, 4, 4, 2, 3, 4, 3, 3, 3 ],
  "36": [ 5, 1, 1, 3, 3, 4, 5, 5, 2, 3, 2, 4, 4, 4, 3 ],
  "37": [ 5, 4, 4, 4, 3, 4, 4, 4, 3, 3, 1, 4, 5, 4, 4 ],
  "38": [ 5, 5, 5, 5, 3, 5, 4, 5, 5, 5, 2, 5, 5, 4, 5 ],
  "39": [ 5, 5, 3, 5, 3, 4, 4, 2, 4, 3, 1, 3, 5, 4, 3 ] },
  "msg":
  [ "A really fantastic camp. ",
    "I enjoyed this camp a lot more than I thought I would. I would like to have more self-led, go at your own pace lessons, like the Excel lesson. The Shiny lesson where we were all going at the same time and kept getting stuck was very confusing.",
    "Just include more variety in the food and the class time.  I didn't like sitting at the computer the entire time reading other people's data.  I liked it better when we went out and got the data ourselves because it made more sense and I understood the data better.   ",
    "I don't think we needed as much time for projects. Instead, use some of the time previously for projects to do more interactive things such as activities. I thought the walk the line activity was fun and Dr. Ge\'s lectures were interesting. Do more R programming but be more basic. I think lots of people just follow the instructions but don\'t learn anything because it is complicated.",
    "The \"staff\" were very very kind and considerate and I liked them very much. \nI think it was organized pretty well.\nMaybe more activities?",
    "I liked the variety in activities to do. I think their could have been a little more variety in the food. Everyone was really nice and helpful.",
    "I think the camp went well this year.  I didn't entirely know what I was getting myself into, but it was definitely worth my week. I enjoyed the opportunity to tour the campus and go to the wellness center.  I think the timing of the activities were perfect because any longer and you lose people and any shorter people don\'t get informed. I do think about 15-20 students is the perfect number.",
    "I thought the camp overall was awesome! I loved learning the R program and will definitely use it in the future. The lectures got to be a little long, but they were manageable. My favorite times were when we were using R to learn and were actively involved in the presentations.  ",
    "Personally, I would recommend cutting down on the lunch break and trying to finish with the work before 5:00, but great job, you've really made the most of what you have.",
    "I was really satisfied with my experience at the data analytics camp; not only did I learn a lot pertaining to coding in R, but I also enjoyed my free time and the like! One recommendation that I have would be to get better food for dinner specifically.",
    "Better options for breakfast. Don't RUSH take time to explain and make sure every one gets it. Better lunch options. maybe some more free time. clearer instructions. ",
    "I enjoyed the camp.  I thought it had a nice schedule and wide range of activities to keep our attention.  I'm not a huge fan of the projects, but they\'re good.  I thought the food could have been a little better, but I loved Honor\'s Hall.  I loved the use of the Wellness Center and I loved learning basic coding using R.  This was all new to me and now I feel like I somewhat know it.  Very good camp.",
    "I think the camp was really good. I enjoyed saying at Honors Hall and all of the extra activities and opportunities like going on tours and going to the Wellness Center. The project really helped finalize my understanding and use of R. A suggestion for the future would be to introduce R more simply on the first day. Overall the camp went well and thank you all for putting it on.",
    "I really liked how there was only a small number of other students attending the camp. I also liked how this camp gave me the opportunity to talk with the head of departments who run the programs that interest me. It was nice that this camp only went from monday until thursday--other camps are usually sunday to friday and I don\'t like how long those are. It was fun to learn R, although I was expecting that the camp would be based more on math  and learning about statistics, but it seem more oriented toward computer programming, which is ok, it just wasn\'t what I expected. It was very nice to stay in Honors halls. This camp was very helpful to me, since I am entering my senior year and I am considering SDSU, however, I don\'t know if it was helpful to the people entering freshman or sophomore years. I am very glad that I attended this camp. I do however, have one complaint about the food: lunch and dinner meals are great, but it seemed like the only options for breakfast were \'dessert breakfast foods\'. In addition to apples, it would have been nice to have oranges or bananas or other non-dessert-like breakfasts foods. I liked the schedule -it had a good balance of class-time and free time and I enjoyed the tours of the campus and its facilities. I didn\'t care for movie night, perhaps you could have the students vote whether to have a movie night or a different activity. I genuinely appreciate the free bag and lanyard. Thank you!",
    "i think that there should be some coffee and hot chocolate stuff for breakfast and meals, also the lunches were almost too long, and there should be more non-learning activities to increase student interaction." ],
  "major":
  [ "my teacher suggests me to attend",
    "Mechanical Engineering",
    "Cyber Security",
    "Finance/Account/Business",
    "I\'m undecided as of right now as I currently am rather unfamiliar with what path I want to take. However, I enjoy economics and I might do something like that college but I also like \"graphic designing\".",
    "Human Development",
    "I don\'t know yet",
    "Chemical Engineering",
    "Game Development(Programming)",
    "something pertaining to medicine.",
    "i do not know yet. and if i did i would not say.",
    "I don\'t know yet... something in the math or computer subjects.",
    "Math, Computer Science, or Engineering",
    "Math...for now",
    "chemistry/biology" ],
  "gender":
  [ "female",
    "female",
    "female",
    "female",
    "female",
    "female",
    "female",
    "female",
    "male",
    "male",
    "male",
    "female",
    "female",
    "male",
    "male" ]
}
